{
  "auto_mapping": null,
  "base_model_name_or_path": "google/flan-t5-large",
  "inference_mode": true,
  "num_attention_heads": 16,
  "num_layers": 24,
  "num_transformer_submodules": 2,
  "num_virtual_tokens": 10,
  "peft_type": "PROMPT_TUNING",
  "prompt_tuning_init": "TEXT",
  "prompt_tuning_init_text": "Start by analyzing the problem and assigning relevant variables and constants. Construct equations for the question using these elements. Pay special attention to intermediate variables and determine their suitability for reuse in subsequent equations. Solve the problem step by step and show the answer.",
  "revision": null,
  "task_type": "SEQ_2_SEQ_LM",
  "token_dim": 1024,
  "tokenizer_name_or_path": "google/flan-t5-large"
}