{
  "auto_mapping": null,
  "base_model_name_or_path": "google/flan-t5-large",
  "inference_mode": true,
  "num_attention_heads": 16,
  "num_layers": 24,
  "num_transformer_submodules": 2,
  "num_virtual_tokens": 10,
  "peft_type": "PROMPT_TUNING",
  "prompt_tuning_init": "TEXT",
  "prompt_tuning_init_text": "Let's first prepare relevant information and make a plan. Execute the plan, ensuring accurate numerical calculation and logical consistency. Present the answer step-by-step.",
  "revision": null,
  "task_type": "SEQ_2_SEQ_LM",
  "token_dim": 1024,
  "tokenizer_name_or_path": "google/flan-t5-large"
}