{
  "auto_mapping": null,
  "base_model_name_or_path": "google/flan-t5-large",
  "inference_mode": true,
  "num_attention_heads": 16,
  "num_layers": 24,
  "num_transformer_submodules": 2,
  "num_virtual_tokens": 10,
  "peft_type": "PROMPT_TUNING",
  "prompt_tuning_init": "TEXT",
  "prompt_tuning_init_text": "Let's first understand the problem and devise a plan to solve the problem. Then, let's carry out the plan to solve the problem step by step. Then, let's answer the question step by step (pay attention to commonsense and logical coherence).",
  "revision": null,
  "task_type": "SEQ_2_SEQ_LM",
  "token_dim": 1024,
  "tokenizer_name_or_path": "google/flan-t5-large"
}